Public Attributes | List of all members
API_SplineDir Struct Reference
Element Manager API
Describes the control handles for Bezier-splines. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | lenPrev
Bezier direction length previous.
double  | lenNext
Bezier direction length next.
double  | dirAng
Bezier direction angle.
Detailed Description
Describes the control handles for Bezier-splines.
Remarks
The picture below illustrates the meaning of these fields.
 Spline direction
Member Data Documentation
◆ dirAng
 API_SplineDir::dirAng
Bezier direction angle.
◆ lenNext
 API_SplineDir::lenNext
Bezier direction length next.
◆ lenPrev
 API_SplineDir::lenPrev
Bezier direction length previous.